# Imorting pandas

In [1]:
import pandas as pd

In [2]:
import numpy as np

# Pandas Data Frames

# Creating pandas data frames

# (01) Using dictionaries

In [6]:
details={"Name":["Jane","David","Kane","Sammie","Jack"],"Age":[32,27,43,45,24],"Gender":["F","M","M","F","M"]}
details

{'Name': ['Jane', 'David', 'Kane', 'Sammie', 'Jack'],
 'Age': [32, 27, 43, 45, 24],
 'Gender': ['F', 'M', 'M', 'F', 'M']}

In [7]:
df1=pd.DataFrame(details)
df1

     Name  Age Gender
0    Jane   32      F
1   David   27      M
2    Kane   43      M
3  Sammie   45      F
4    Jack   24      M

# (02) Using numpy arrays

In [8]:
arr=np.array([[12,24],[23,15],[34,37]])
arr

array([[12, 24],
       [23, 15],
       [34, 37]])

In [9]:
df2=pd.DataFrame(arr,columns=["Col1","Col2"])
df2

   Col1  Col2
0    12    24
1    23    15
2    34    37

# (03) Creating data frames using CSV files

In [33]:
df=pd.read_csv("D:\\Data Science\\iris.CSV")

In [34]:
df

     Sepal.Length  Sepal.Width  Petal.Length  Petal.Width    Species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [29]:
type(df1)

pandas.core.frame.DataFrame

In [30]:
type(df2)

pandas.core.frame.DataFrame

In [35]:
type(df)

pandas.core.frame.DataFrame

# Top values of the data set

In [36]:
df.head()

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [37]:
df.head(3)

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa

# Bottom values of the data set

In [38]:
df.tail()

     Sepal.Length  Sepal.Width  Petal.Length  Petal.Width    Species
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

In [39]:
df.tail(8)

     Sepal.Length  Sepal.Width  Petal.Length  Petal.Width    Species
142           5.8          2.7           5.1          1.9  virginica
143           6.8          3.2           5.9          2.3  virginica
144           6.7          3.3           5.7          2.5  virginica
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

In [43]:
details=pd.DataFrame({"Name":["Jane","David","Kane","Sammie","Jack"],"Age":[32,27,43,45,24],"Gender":["F","M","M","F","M"]})
details

     Name  Age Gender
0    Jane   32      F
1   David   27      M
2    Kane   43      M
3  Sammie   45      F
4    Jack   24      M

In [44]:
details.head(2)

    Name  Age Gender
0   Jane   32      F
1  David   27      M

In [45]:
details.tail(3)

     Name  Age Gender
2    Kane   43      M
3  Sammie   45      F
4    Jack   24      M

# Description

In [46]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Sepal.Length  150 non-null    float64
 1   Sepal.Width   150 non-null    float64
 2   Petal.Length  150 non-null    float64
 3   Petal.Width   150 non-null    float64
 4   Species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

In [47]:
details.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    5 non-null      object
 1   Age     5 non-null      int64
 2   Gender  5 non-null      object
dtypes: int64(1), object(2)
memory usage: 252.0+ bytes

# Columns & indexes of the data set

In [49]:
list(df.columns)

['Sepal.Length', 'Sepal.Width', 'Petal.Length', 'Petal.Width', 'Species']

In [50]:
df.index

RangeIndex(start=0, stop=150, step=1)

In [25]:
details=pd.DataFrame({"Name":["Jane","David","Kane","Sammie","Jack"],
                      "Age":[32,27,43,45,24],"Gender":["F","M","M","F","M"]},
                     index=["a","b","c","d","e"])
details

     Name  Age Gender
a    Jane   32      F
b   David   27      M
c    Kane   43      M
d  Sammie   45      F
e    Jack   24      M

In [26]:
details.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

# Shape of the data frame

In [27]:
df.shape

(5, 3)

In [55]:
details.shape

(5, 3)

# Data type of columns

In [28]:
details["Age"].dtype

dtype('int64')

# Separating data types in data frames

In [56]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Sepal.Length  150 non-null    float64
 1   Sepal.Width   150 non-null    float64
 2   Petal.Length  150 non-null    float64
 3   Petal.Width   150 non-null    float64
 4   Species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

In [58]:
dff=df.select_dtypes(include=float)
dff.head()

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width
0           5.1          3.5           1.4          0.2
1           4.9          3.0           1.4          0.2
2           4.7          3.2           1.3          0.2
3           4.6          3.1           1.5          0.2
4           5.0          3.6           1.4          0.2

In [63]:
dfo=df.select_dtypes(include=object)
dfo.head()

  Species
0  setosa
1  setosa
2  setosa
3  setosa
4  setosa

# (05) Creating data frames using Excel files

In [64]:
pd.read_excel("C:\\Users\\ACER\\Documents\\Excel\\Excel Data.XLSX")

     Sepal.Length  Sepal.Width  Petal.Length  Petal.Width    Species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [65]:
df1.head()

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [66]:
pd.read_excel("C:\\Users\\ACER\\Documents\\Excel\\Excel Data.XLSX",
              sheet_name="marks")

   ID  Marks
0   1     67
1   2     78
2   3     76
3   4     66
4   5     89

In [69]:
ef=pd.ExcelFile("C:\\Users\\ACER\\Documents\\Excel\\Excel Data.XLSX")

In [70]:
ef.sheet_names

['iris', 'marks']

In [72]:
df1=ef.parse("iris")
df1.head()

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [74]:
df2=ef.parse("marks")
df2

   ID  Marks
0   1     67
1   2     78
2   3     76
3   4     66
4   5     89

# Adding new columns

In [15]:
df=pd.DataFrame({"Col1":[12,22,23,34,45],"Col2":[45,43,44,46,54],"Col3":[56,43,46,67,65]})
df

   Col1  Col2  Col3
0    12    45    56
1    22    43    43
2    23    44    46
3    34    46    67
4    45    54    65

In [18]:
df["Col4"]=[43,26,66,78,89]
df

   Col1  Col2  Col3  Col4
0    12    45    56    43
1    22    43    43    26
2    23    44    46    66
3    34    46    67    78
4    45    54    65    89

# Accessing columns & elements

In [31]:
df=pd.DataFrame({"Col1":[12,22,23,34,45],"Col2":[45,43,44,46,54],"Col3":[56,43,46,67,65]})
df

   Col1  Col2  Col3
0    12    45    56
1    22    43    43
2    23    44    46
3    34    46    67
4    45    54    65

# Accessing columns

In [12]:
df["Col1"]

0    12
1    22
2    23
3    34
4    45
Name: Col1, dtype: int64

In [13]:
df[["Col1","Col3"]]

   Col1  Col3
0    12    56
1    22    43
2    23    46
3    34    67
4    45    65

# Accessing elements

In [32]:
df=pd.DataFrame({"Col1":[12,22,23,34,45],"Col2":[45,43,44,46,54],"Col3":[56,43,46,67,65]})
df

   Col1  Col2  Col3
0    12    45    56
1    22    43    43
2    23    44    46
3    34    46    67
4    45    54    65

In [34]:
df.iloc[1,2]

43

In [37]:
df.iloc[2:4,:2]

   Col1  Col2
2    23    44
3    34    46

In [38]:
df.iloc[:,1]

0    45
1    43
2    44
3    46
4    54
Name: Col2, dtype: int64

In [39]:
df.iloc[3,:]

Col1    34
Col2    46
Col3    67
Name: 3, dtype: int64

In [40]:
df.iat[1,2]

43

In [41]:
df.at[1,"Col2"]

43

In [42]:
df.loc[1,"Col2"]

43

# Converting to arrays

In [44]:
df=pd.DataFrame({"Col1":[12,22,23,34,45],"Col2":[45,43,44,46,54],"Col3":[56,43,46,67,65]})
df

   Col1  Col2  Col3
0    12    45    56
1    22    43    43
2    23    44    46
3    34    46    67
4    45    54    65

In [45]:
df.values

array([[12, 45, 56],
       [22, 43, 43],
       [23, 44, 46],
       [34, 46, 67],
       [45, 54, 65]], dtype=int64)

In [46]:
df["Col1"].values

array([12, 22, 23, 34, 45], dtype=int64)

# Basic column operations

In [49]:
data = np.arange(10).reshape(5,2)
df = pd.DataFrame(data,columns=["Col1","Col2"])
df

   Col1  Col2
0     0     1
1     2     3
2     4     5
3     6     7
4     8     9

In [53]:
df["Col3"]=df["Col1"]+df["Col2"]
df

   Col1  Col2  Col3
0     0     1     1
1     2     3     5
2     4     5     9
3     6     7    13
4     8     9    17

In [59]:
df["Col4"]=["A" if i>=10 else "B" for i in df["Col3"]]

In [60]:
df

   Col1  Col2  Col3 Col4
0     0     1     1    B
1     2     3     5    B
2     4     5     9    B
3     6     7    13    A
4     8     9    17    A

# Pandas data frames with apply function

In [6]:
data = np.arange(10).reshape(5,2)
df = pd.DataFrame(data,columns=["Col1","Col2"])
df

   Col1  Col2
0     0     1
1     2     3
2     4     5
3     6     7
4     8     9

In [8]:
df.apply(sum,axis=0)

Col1    20
Col2    25
dtype: int64

In [9]:
df.apply(sum,axis=1)

0     1
1     5
2     9
3    13
4    17
dtype: int64

In [10]:
df.apply(len,axis=0)

Col1    5
Col2    5
dtype: int64

In [11]:
df.apply(np.mean,axis=0)

Col1    4.0
Col2    5.0
dtype: float64

In [12]:
df=pd.DataFrame({"English":[56,46,68,43,56],"Maths":[24,46,77,64,53]})
df

   English  Maths
0       56     24
1       46     46
2       68     77
3       43     64
4       56     53

In [3]:
fun=lambda L : "Pass" if np.mean(L)>=50 else "Fail"

In [13]:
df["Result"]=df.apply(fun,axis=1)
df

   English  Maths Result
0       56     24   Fail
1       46     46   Fail
2       68     77   Pass
3       43     64   Pass
4       56     53   Pass

# Pandas data frames with map function

In [ ]:
data = np.arange(10).reshape(5,2)
df = pd.DataFrame(data,columns=["Col1","Col2"])
df

In [ ]:
df=pd.DataFrame({"English":[45,54,57,46,58],"Maths":[42,54,57,41,76]})
df

# Selecting rows that have certain values

# Boolean masking technique

In [12]:
df=pd.DataFrame({"Name":["A","B","C","D","E","F"],"Age":[23,33,21,35,23,34],"Result":["Pass","Fail","Pass","Pass","Fail","Fail"]})
df

  Name  Age Result
0    A   23   Pass
1    B   33   Fail
2    C   21   Pass
3    D   35   Pass
4    E   23   Fail
5    F   34   Fail

In [16]:
df[df["Result"]=="Pass"]

  Name  Age Result
0    A   23   Pass
2    C   21   Pass
3    D   35   Pass

In [18]:
df[df["Age"]>=30]

  Name  Age Result
1    B   33   Fail
3    D   35   Pass
5    F   34   Fail

In [9]:
a=np.array([10,20,30,40,50])
b=np.array([42,2,53,7,8])

In [31]:
(a>b) & (b%2==0)

array([False,  True, False, False,  True])

In [32]:
df[(df["Result"]=="Pass") & (df["Age"]<30)]

  Name  Age Result
0    A   23   Pass
2    C   21   Pass

In [ ]:
# Selecting with map function

In [4]:
fun=lambda L : "Pass" in L

In [5]:
p=[2,1,4,5,6]

In [6]:
2 in p

True

In [19]:
df["Result"].map(fun)

0     True
1    False
2     True
3     True
4    False
5    False
Name: Result, dtype: bool

In [21]:
df[df["Result"].map(fun)] #boolean masking

  Name  Age Result
0    A   23   Pass
2    C   21   Pass
3    D   35   Pass

In [ ]:
# Pandas Queries#

In [22]:
df

  Name  Age Result
0    A   23   Pass
1    B   33   Fail
2    C   21   Pass
3    D   35   Pass
4    E   23   Fail
5    F   34   Fail

In [23]:
df.query('Result=="Pass"')

  Name  Age Result
0    A   23   Pass
2    C   21   Pass
3    D   35   Pass

In [24]:
df.query("Age>=30")

  Name  Age Result
1    B   33   Fail
3    D   35   Pass
5    F   34   Fail

In [28]:
df.query('Result=="Pass" and Age>30')

  Name  Age Result
3    D   35   Pass

# Data summaries

In [5]:
data=np.random.random(20).reshape(5,4)
data

array([[0.49809718, 0.61319725, 0.63524674, 0.81658502],
       [0.992874  , 0.04678367, 0.54963435, 0.48839008],
       [0.65308193, 0.97380167, 0.2800783 , 0.35871872],
       [0.8370344 , 0.25243136, 0.80396691, 0.55770584],
       [0.83444689, 0.66415787, 0.75678433, 0.63498933]])

In [8]:
df=pd.DataFrame(data,columns=["A","B","C","D"],index=["a","b","c","d","e"])
df

          A         B         C         D
a  0.498097  0.613197  0.635247  0.816585
b  0.992874  0.046784  0.549634  0.488390
c  0.653082  0.973802  0.280078  0.358719
d  0.837034  0.252431  0.803967  0.557706
e  0.834447  0.664158  0.756784  0.634989

# Summaries for each column

In [10]:
df.describe()

              A         B         C         D
count  5.000000  5.000000  5.000000  5.000000
mean   0.763107  0.510074  0.605142  0.571278
std    0.190842  0.364156  0.207473  0.170639
min    0.498097  0.046784  0.280078  0.358719
25%    0.653082  0.252431  0.549634  0.488390
50%    0.834447  0.613197  0.635247  0.557706
75%    0.837034  0.664158  0.756784  0.634989
max    0.992874  0.973802  0.803967  0.816585

# Summaries for each row

In [12]:
df.transpose().describe()

              a         b         c         d         e
count  4.000000  4.000000  4.000000  4.000000  4.000000
mean   0.640782  0.519421  0.566420  0.612785  0.722595
std    0.131729  0.387048  0.315490  0.270633  0.090865
min    0.498097  0.046784  0.280078  0.252431  0.634989
25%    0.584422  0.377988  0.339059  0.481387  0.656866
50%    0.624222  0.519012  0.505900  0.680836  0.710471
75%    0.680581  0.660444  0.733262  0.812234  0.776200
max    0.816585  0.992874  0.973802  0.837034  0.834447

# Categorical columns

In [14]:
df=pd.DataFrame({"A":[23,34,21,45,67],"B":[45,24,67,88,67],"C":["a","a","b","b","a"]})
df

    A   B  C
0  23  45  a
1  34  24  a
2  21  67  b
3  45  88  b
4  67  67  a

In [15]:
 df.describe()

               A          B
count   5.000000   5.000000
mean   38.000000  58.200000
std    18.841444  24.427444
min    21.000000  24.000000
25%    23.000000  45.000000
50%    34.000000  67.000000
75%    45.000000  67.000000
max    67.000000  88.000000

In [16]:
df.describe(include="all")

                A          B    C
count    5.000000   5.000000    5
unique        NaN        NaN    2
top           NaN        NaN    a
freq          NaN        NaN    3
mean    38.000000  58.200000  NaN
std     18.841444  24.427444  NaN
min     21.000000  24.000000  NaN
25%     23.000000  45.000000  NaN
50%     34.000000  67.000000  NaN
75%     45.000000  67.000000  NaN
max     67.000000  88.000000  NaN

# Finding sums for columns and rows separately

In [19]:
data=np.random.random(10).reshape(5,2)
data

array([[0.7510749 , 0.75903216],
       [0.05199694, 0.43151098],
       [0.71625012, 0.0649013 ],
       [0.73375061, 0.46247459],
       [0.21865528, 0.89124674]])

In [20]:
df=pd.DataFrame(data,columns=["A","B"],index=["a","b","c","d","e"])
df

          A         B
a  0.751075  0.759032
b  0.051997  0.431511
c  0.716250  0.064901
d  0.733751  0.462475
e  0.218655  0.891247

In [21]:
df.sum()

A    2.471728
B    2.609166
dtype: float64

In [22]:
df.sum(axis=1)

a    1.510107
b    0.483508
c    0.781151
d    1.196225
e    1.109902
dtype: float64

# Cumulative summaries

In [23]:
df.cumsum()

          A         B
a  0.751075  0.759032
b  0.803072  1.190543
c  1.519322  1.255444
d  2.253073  1.717919
e  2.471728  2.609166

In [24]:
df.cumsum(axis=1)

          A         B
a  0.751075  1.510107
b  0.051997  0.483508
c  0.716250  0.781151
d  0.733751  1.196225
e  0.218655  1.109902

# Finding means for columns and rows separately

In [25]:
df.mean()

A    0.494346
B    0.521833
dtype: float64

In [26]:
df.mean(axis=1)

a    0.755054
b    0.241754
c    0.390576
d    0.598113
e    0.554951
dtype: float64

# Finding minumum and maximum for columns and rows separately

In [27]:
df.min()

A    0.051997
B    0.064901
dtype: float64

In [28]:
df.min(axis=1)

a    0.751075
b    0.051997
c    0.064901
d    0.462475
e    0.218655
dtype: float64

In [29]:
df.max()

A    0.751075
B    0.891247
dtype: float64

In [30]:
df.max(axis=1)

a    0.759032
b    0.431511
c    0.716250
d    0.733751
e    0.891247
dtype: float64

# Dropping rows & columns

In [50]:
df=pd.DataFrame({"Name":["A","B","C"],"Age":[23,33,21],"Result":["Pass","Fail","Pass"]},index=["a","b","c"])
df

  Name  Age Result
a    A   23   Pass
b    B   33   Fail
c    C   21   Pass

# Dropping rows

In [52]:
df1=df.drop("a")
df1

  Name  Age Result
c    C   21   Pass

In [41]:
df     # Original dataframe has not been changed

  Name  Age Result
a    A   23   Pass
b    B   33   Fail
c    C   21   Pass

In [51]:
df.drop("b",inplace=True)

In [42]:
df=pd.DataFrame({"Name":["A","B","C"],"Age":[23,33,21],"Result":["Pass","Fail","Pass"]})
df

  Name  Age Result
0    A   23   Pass
1    B   33   Fail
2    C   21   Pass

In [43]:
 df.drop(1)

  Name  Age Result
0    A   23   Pass
2    C   21   Pass

# Dropping columns

In [64]:
df=pd.DataFrame({"Name":["A","B","C"],"Age":[23,33,21],"Result":["Pass","Fail","Pass"]},index=["a","b","c"])
df

  Name  Age Result
a    A   23   Pass
b    B   33   Fail
c    C   21   Pass

In [65]:
df.drop("Name",axis=1)

   Age Result
a   23   Pass
b   33   Fail
c   21   Pass

In [67]:
df.drop(["Name","Result"],axis=1)

   Age
a   23
b   33
c   21

# Sorting data frames with column values

In [4]:
d={"Name":["Sam","Jane","Kane"],"Mark1":[67,54,44],"Mark2":[56,56,67],"Mark3":[78,89,76]}
df=pd.DataFrame(d)
df

   Name  Mark1  Mark2  Mark3
0   Sam     67     56     78
1  Jane     54     56     89
2  Kane     44     67     76

In [6]:
df.sort_values(by="Mark1")

   Name  Mark1  Mark2  Mark3
2  Kane     44     67     76
1  Jane     54     56     89
0   Sam     67     56     78

In [7]:
df.sort_values(by="Mark1",ascending=False)

   Name  Mark1  Mark2  Mark3
0   Sam     67     56     78
1  Jane     54     56     89
2  Kane     44     67     76

In [8]:
df.sort_values(by="Name",ascending=False) # It sorted in alphabetical order

   Name  Mark1  Mark2  Mark3
0   Sam     67     56     78
2  Kane     44     67     76
1  Jane     54     56     89

# Grouping data frames with categorical data

In [6]:
d={"ID":[1001,1002,1003,1004,1005],"Age":[23,33,34,24,25],"Gender":["F","F","M","F","M"],"Marks":[67,69,76,74,90]}
df=pd.DataFrame(d)
df

     ID  Age Gender  Marks
0  1001   23      F     67
1  1002   33      F     69
2  1003   34      M     76
3  1004   24      F     74
4  1005   25      M     90

In [12]:
g=df.groupby("Gender")

In [16]:
g1=list(g)

In [18]:
g1[0]

('F',
      ID  Age Gender  Marks
 0  1001   23      F     67
 1  1002   33      F     69
 3  1004   24      F     74)

# Using generators

In [15]:
x=df.groupby("Gender").__iter__()

In [16]:
x.__next__()

('F',
      ID  Age Gender  Marks
 0  1001   23      F     67
 1  1002   33      F     69
 3  1004   24      F     74)

In [17]:
y=x.__next__()
y

('M',
      ID  Age Gender  Marks
 2  1003   34      M     76
 4  1005   25      M     90)

# Selecting a specific group

In [18]:
d={"ID":[1001,1002,1003,1004,1005],"Age":[23,33,34,24,25],"Gender":["F","F","M","F","M"],"Marks":[67,69,76,74,90]}
df=pd.DataFrame(d)
df

     ID  Age Gender  Marks
0  1001   23      F     67
1  1002   33      F     69
2  1003   34      M     76
3  1004   24      F     74
4  1005   25      M     90

In [22]:
df.groupby("Gender").get_group("F")

     ID  Age Gender  Marks
0  1001   23      F     67
1  1002   33      F     69
3  1004   24      F     74

In [23]:
df.groupby("Gender").get_group("M")

     ID  Age Gender  Marks
2  1003   34      M     76
4  1005   25      M     90

# Summaries for other variables with grouping

In [32]:
d={"ID":[1001,1002,1003,1004,1005],"Age":[23,33,34,24,25],"Gender":["F","F","M","F","M"],"Marks":[67,69,76,74,90]}
df=pd.DataFrame(d)
df

     ID  Age Gender  Marks
0  1001   23      F     67
1  1002   33      F     69
2  1003   34      M     76
3  1004   24      F     74
4  1005   25      M     90

In [33]:
df.drop("ID", axis=1, inplace=True)

In [34]:
df.groupby("Gender").mean()

              Age  Marks
Gender
F       26.666667   70.0
M       29.500000   83.0

In [35]:
df.groupby("Gender").sum()

        Age  Marks
Gender
F        80    210
M        59    166

In [36]:
df.groupby("Gender")["Age"].mean()

Gender
F    26.666667
M    29.500000
Name: Age, dtype: float64

# Summarizing other variables with grouping by using multiple options

In [37]:
df.groupby("Gender").agg(["mean","sum","min","max","median","var"])

              Age                               Marks                      \
             mean sum min max median        var  mean  sum min max median
Gender
F       26.666667  80  23  33   24.0  30.333333  70.0  210  67  74   69.0
M       29.500000  59  25  34   29.5  40.500000  83.0  166  76  90   83.0


         var
Gender
F       13.0
M       98.0

# Grouping with more than one columns

In [38]:
d={"Age":[23,33,34,24,25],"Gender":["F","F","M","F","M"],"Marks":[67,69,76,74,90],"University":["UOC","UOC","UOC","UOP","UOP"]}
df=pd.DataFrame(d)
df

   Age Gender  Marks University
0   23      F     67        UOC
1   33      F     69        UOC
2   34      M     76        UOC
3   24      F     74        UOP
4   25      M     90        UOP

In [39]:
df.groupby(["University","Gender"]).mean()

                    Age  Marks
University Gender
UOC        F       28.0   68.0
           M       34.0   76.0
UOP        F       24.0   74.0
           M       25.0   90.0

# Concatenating data frames

In [42]:
df1=pd.DataFrame(np.random.random((5,2)),columns=["A","B"])
df2=pd.DataFrame(np.random.random((5,2)),columns=["A","B"])
df3=pd.DataFrame(np.random.random((5,2)),columns=["C","D"])

In [43]:
df1

          A         B
0  0.236565  0.476719
1  0.744123  0.337691
2  0.298691  0.517642
3  0.766966  0.946155
4  0.322220  0.191611

In [44]:
df2

          A         B
0  0.027644  0.876876
1  0.558045  0.812358
2  0.698743  0.336044
3  0.486178  0.164781
4  0.806958  0.478234

In [46]:
df3

          C         D
0  0.012520  0.456663
1  0.465016  0.244136
2  0.959552  0.452464
3  0.873867  0.714817
4  0.699735  0.702653

# Concatenating along the rows

In [48]:
pd.concat([df1,df2],ignore_index=True)

          A         B
0  0.236565  0.476719
1  0.744123  0.337691
2  0.298691  0.517642
3  0.766966  0.946155
4  0.322220  0.191611
5  0.027644  0.876876
6  0.558045  0.812358
7  0.698743  0.336044
8  0.486178  0.164781
9  0.806958  0.478234

# Concatenating along the columns

In [50]:
pd.concat([df1,df3],axis=1)

          A         B         C         D
0  0.236565  0.476719  0.012520  0.456663
1  0.744123  0.337691  0.465016  0.244136
2  0.298691  0.517642  0.959552  0.452464
3  0.766966  0.946155  0.873867  0.714817
4  0.322220  0.191611  0.699735  0.702653

# Merging data frames

In [55]:
df1=pd.DataFrame({"ID":[1,2,3,4],"Val1":[23,33,34,45]})
df2=pd.DataFrame({"ID":[3,4,5,6],"Val2":[56,32,67,65]})

In [56]:
df1

   ID  Val1
0   1    23
1   2    33
2   3    34
3   4    45

In [57]:
df2

   ID  Val2
0   3    56
1   4    32
2   5    67
3   6    65

# Focus on the common Ids

In [59]:
pd.merge(df1,df2,on="ID",how="inner")

   ID  Val1  Val2
0   3    34    56
1   4    45    32

# Focus on the all Ids

In [60]:
pd.merge(df1,df2,on="ID",how="outer")

   ID  Val1  Val2
0   1  23.0   NaN
1   2  33.0   NaN
2   3  34.0  56.0
3   4  45.0  32.0
4   5   NaN  67.0
5   6   NaN  65.0

# Focus on the left side data frame Ids

In [61]:
pd.merge(df1,df2,on="ID",how="left")

   ID  Val1  Val2
0   1    23   NaN
1   2    33   NaN
2   3    34  56.0
3   4    45  32.0

# Focus on the right side data frame Ids

In [62]:
pd.merge(df1,df2,on="ID",how="right")

   ID  Val1  Val2
0   3  34.0    56
1   4  45.0    32
2   5   NaN    67
3   6   NaN    65

# Using an indicator for showing how the tables are merged

In [64]:
pd.merge(df1,df2,on="ID",how="outer",indicator=True)

   ID  Val1  Val2      _merge
0   1  23.0   NaN   left_only
1   2  33.0   NaN   left_only
2   3  34.0  56.0        both
3   4  45.0  32.0        both
4   5   NaN  67.0  right_only
5   6   NaN  65.0  right_only

# Merging based on more than one column

In [66]:
df1=pd.DataFrame({"ID1":[1,2,3,4],"ID2":[7,8,9,10],"Val1":[23,33,34,45]})
df2=pd.DataFrame({"ID1":[2,3,5,6],"ID2":[8,9,10,11],"Val2":[56,32,67,65]})

In [67]:
df1

   ID1  ID2  Val1
0    1    7    23
1    2    8    33
2    3    9    34
3    4   10    45

In [68]:
df2

   ID1  ID2  Val2
0    2    8    56
1    3    9    32
2    5   10    67
3    6   11    65

In [70]:
pd.merge(df1,df2,on=["ID1","ID2"],how="outer")

   ID1  ID2  Val1  Val2
0    1    7  23.0   NaN
1    2    8  33.0  56.0
2    3    9  34.0  32.0
3    4   10  45.0   NaN
4    5   10   NaN  67.0
5    6   11   NaN  65.0

In [71]:
pd.merge(df1,df2,on=["ID1","ID2"],how="inner")

   ID1  ID2  Val1  Val2
0    2    8    33    56
1    3    9    34    32

# Counting values

In [72]:
d={"Col1":["P","P","Q"],"Col2":["X","Y","Z"],"Col3":["A","B","C"]}
df=pd.DataFrame(d)
df

  Col1 Col2 Col3
0    P    X    A
1    P    Y    B
2    Q    Z    C

In [75]:
pd.value_counts(df["Col1"])

C:\Users\ACER\AppData\Local\Temp\ipykernel_13748\2621108068.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(df["Col1"])

Col1
P    2
Q    1
Name: count, dtype: int64

In [76]:
df["Col1"].value_counts()

Col1
P    2
Q    1
Name: count, dtype: int64

# Unique values in a column

In [77]:
d={"Col1":["P","P","Q"],"Col2":["X","Y","Z"],"Col3":["A","B","C"]}
df=pd.DataFrame(d)
df

  Col1 Col2 Col3
0    P    X    A
1    P    Y    B
2    Q    Z    C

In [78]:
pd.unique(df["Col1"])

array(['P', 'Q'], dtype=object)

In [79]:
df["Col1"].unique()

array(['P', 'Q'], dtype=object)

# Counting unique elements

In [83]:
df["Col1"].nunique()

2

# Replace values in data frame

In [86]:
d={"Col1":["P","P","Q"],"Col2":["X","Y","Z"],"Col3":[3,6,8]}
df=pd.DataFrame(d)
df

  Col1 Col2  Col3
0    P    X     3
1    P    Y     6
2    Q    Z     8

In [88]:
df["Col1"].replace("P","A",inplace=True)

In [89]:
df

  Col1 Col2  Col3
0    A    X     3
1    A    Y     6
2    Q    Z     8

In [92]:
df["Col2"].replace(["X","Y"],["K","L"],inplace=True)

In [93]:
df

  Col1 Col2  Col3
0    A    K     3
1    A    L     6
2    Q    Z     8

# Stacking & Unstacking data frames

In [94]:
d={"Col1":["P","P","Q"],"Col2":["X","Y","Z"],"Col3":[3,6,8]}
df=pd.DataFrame(d)

In [95]:
df

  Col1 Col2  Col3
0    P    X     3
1    P    Y     6
2    Q    Z     8

In [96]:
df.stack()

0  Col1    P
   Col2    X
   Col3    3
1  Col1    P
   Col2    Y
   Col3    6
2  Col1    Q
   Col2    Z
   Col3    8
dtype: object

In [100]:
df1.unstack()

ID1   0     1
      1     2
      2     3
      3     4
ID2   0     7
      1     8
      2     9
      3    10
Val1  0    23
      1    33
      2    34
      3    45
dtype: int64

# Creating Pivot tables

In [102]:
d={"Cat":["A","B","B","A","C","A","C","B"],"Val":[4,5,6,8,3,9,8,2]}
df=pd.DataFrame(d)
df

  Cat  Val
0   A    4
1   B    5
2   B    6
3   A    8
4   C    3
5   A    9
6   C    8
7   B    2

In [105]:
df.pivot_table(index=["Cat","Val"],aggfunc="mean")

Empty DataFrame
Columns: []
Index: [(A, 4), (A, 8), (A, 9), (B, 2), (B, 5), (B, 6), (C, 3), (C, 8)]

In [107]:
d={"Cat":["A","B","B","A","C","A","C","B"],"Rank":["1","2","1","2","1","2","1","2"],"Val":[4,5,6,8,3,9,8,2]}
df=pd.DataFrame(d)

In [108]:
df

  Cat Rank  Val
0   A    1    4
1   B    2    5
2   B    1    6
3   A    2    8
4   C    1    3
5   A    2    9
6   C    1    8
7   B    2    2

In [109]:
d={"Cat":["A","B","B","A","C","A","C","B"],"Rank":["1","2","1","2","1","2","1","2"],
   "Val1":[4,5,6,8,3,9,8,2],"Val2":[6,4,7,9,3,5,9,2]}
df=pd.DataFrame(d)

In [110]:
df

  Cat Rank  Val1  Val2
0   A    1     4     6
1   B    2     5     4
2   B    1     6     7
3   A    2     8     9
4   C    1     3     3
5   A    2     9     5
6   C    1     8     9
7   B    2     2     2

# Binning

In [120]:
d={"ID":[1001,1002,1003,1004,1005],"Marks":[78,88,45,67,59]}
df=pd.DataFrame(d)
df

     ID  Marks
0  1001     78
1  1002     88
2  1003     45
3  1004     67
4  1005     59

In [121]:
df["Grade"] = ["A" if m >= 80 else "B" if m >= 65 else "C" if m >= 50 else "F" for m in df["Marks"]]
df

     ID  Marks Grade
0  1001     78     B
1  1002     88     A
2  1003     45     F
3  1004     67     B
4  1005     59     C

In [122]:
d={"ID":[1001,1002,1003,1004,1005],"Marks":[78,88,45,67,59]}
df=pd.DataFrame(d)
df

     ID  Marks
0  1001     78
1  1002     88
2  1003     45
3  1004     67
4  1005     59

In [124]:
bins=[0,50,65,80,100]
grades=["F","C","B","A"]
df["Grades"]=pd.cut(df["Marks"],bins,labels=grades)
df

     ID  Marks Grades
0  1001     78      B
1  1002     88      A
2  1003     45      F
3  1004     67      B
4  1005     59      C

# Largest and smallest values in a column

In [125]:
d={"Cat":["A","B","B","A","C","A","C","B"],"Rank":["1","2","1","2","1","2","1","2"],"Val":[4,5,6,8,3,9,8,2]}
df=pd.DataFrame(d)
df

  Cat Rank  Val
0   A    1    4
1   B    2    5
2   B    1    6
3   A    2    8
4   C    1    3
5   A    2    9
6   C    1    8
7   B    2    2

In [126]:
df["Val"].min()

2

In [127]:
df.nsmallest(3,"Val")

  Cat Rank  Val
7   B    2    2
4   C    1    3
0   A    1    4

In [129]:
df.nlargest(2,"Val")

  Cat Rank  Val
5   A    2    9
3   A    2    8

# Working with indexes & columns

In [ ]:
d={"Name":["Sam","Pam","Jane"],"Marks":[56,32,78],"Class":[1,2,3]}
df=pd.DataFrame(d,index=["a","b","c"])
df

# Columns of the data frame

# Indexes of the data frame

# Changing the order of the rows

# Changing the order of the columns

# Renaming the indexes & columns

In [ ]:
d={"Name":["Sam","Pam","Jane"],"Marks":[56,32,78],"Class":[1,2,3]}
df=pd.DataFrame(d,index=["a","b","c"])
df

# Making indexes as a column

In [ ]:
d={"Name":["Sam","Pam","Jane"],"Marks":[56,32,78],"Class":[1,2,3]}
df=pd.DataFrame(d,index=["a","b","c"])
df

# Making a column as the index set

In [ ]:
d={"Name":["Sam","Pam","Jane"],"Marks":[56,32,78],"Class":[1,2,3]}
df=pd.DataFrame(d,index=["a","b","c"])
df

# Permutation & taking samples

In [ ]:
d={"A":np.arange(1,11),"B":np.random.random(10),"C":np.random.randn(10)}
df=pd.DataFrame(d)
df

# Method 01 - Taking a shuffled data frame

# Shuffling data

# Random sample

# Method 02 - Shuffling existing indexes

# Method 03 - Sample method

# Random sample

# Shuffling data frame

# Working with dates

# Converting strings to dates

In [ ]:
df = pd.DataFrame({'date': ['3/10/2000', '3/11/2000', '3/12/2000'],'value': [2, 3, 4]})
df

In [ ]:
df = pd.DataFrame({'date': ['3/10/2000', '3/11/2000', '3/12/2000'],'value': [2, 3, 4]})
df

In [ ]:
df = pd.DataFrame({'date': ['3-10-2000', '3-11-2000', '3-12-2000'],'value': [2, 3, 4]})
df

In [ ]:
df = pd.DataFrame({'date': ['2016-6-10 20:30:0','2016-7-1 19:45:30','2013-10-12 4:5:1'],'value': [2, 3, 4]})
df

# Assemble a datetime from multiple columns

In [ ]:
df = pd.DataFrame({'year': [2015, 2016],'month': [2, 3],'day': [4, 5]})
df

# Separate year, month, and day

In [ ]:
df = pd.DataFrame({'name': ['Tom', 'Andy', 'Lucas'],'DOB': ['08-05-1997', '04-28-1996', '12-16-1995']})
df

# Get more information